<?php

$snip = isset($snip) ? $snip : '';
$param = isset($param) ? $param : '';

	/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
	/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
	$start = microtime(true);
	//Время выполнения :0.00609 секунд  стало - Время выполнения :0.00109 секунд
	//Время выполнения :0.00602 секунд
	//Время выполнения :67.25434 секунд  стало - 0.00347 секунд

	include_once (MODX_BASE_PATH.'assets/snippets/big_cache/bc.class.php');
	$id=$modx->documentIdentifier;
	$cache=  bc::create($snip.'_for_'.$id,100000,'snippet');
	// если файлу существует и время жизни кеша ещё не искекло
	if ($cache->exists() and $cache->time_old()){
	$data= $cache->read(); // получаем данные из кеша
	}
	else {

	// генерируем данные заново и заносим в кеш
	/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
	/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/

/**===============================================*/
$p_arr1 = explode("|+|", $param);
$pp=array();
foreach ($p_arr1 as $key1 => $value1) {
	$p_arr2 = explode("=+=", $value1);
	$pp[$p_arr2[0]]=$p_arr2[1];
}
//var_dump($p_arr2);
//var_dump($pp);

if ($snip!=''){
	$data = $modx->runSnippet($snip, $pp);
}
/**===============================================*/

	/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
	/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
	if ($cache->write ($data)){}  //Записали
	else {  //Не записали
	}
	}
	/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
	/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/

echo $data;

/*
$end = microtime(true);
$runtime = $end - $start;
echo "<br/> Время выполнения :". 10*round($runtime, 6) . " секунд";
*/